# 01 - Intro to Pandas

## Objectives:
- Introduction about Jupyter Environment
- Refresher on Python
- Pandas data structure (Series and DataFrame)

## Importing Packages

In [1]:
import pandas as pd

## Practice Section (15 minutes)

1. Create a `Series` object with `int64` data type and size of 5. Give it a unique name.
2. Create a `Series` object with `float64` data type and size of 8. Give it a unique name.
3. Create a `Series` object with `object` data type and size of 3. Give it a unique name.
4. Create a `DataFrame` object with all `int64` data type and shape of `(5,2)`.
5. Create a `DataFrame` object with `float64`, `float64` and `object` data type and shape of `(8,3)`, columns in that order. Make use of the `Series` object created in Practice 1, 2, and 3.

In [17]:
# 1. Create a Series object with int64 data type and size of 5. Give it a unique name.
series_1 = pd.Series([100,200,300,400,500], dtype='int64', name='int_series')
series_1

0    100
1    200
2    300
3    400
4    500
Name: int_series, dtype: int64

In [18]:
# 2. Create a `Series` object with `float64` data type and size of 8. Give it a unique name.
series_2 = pd.Series([.1,.2,.3,.4,.5,.6,.7,.8], dtype='float64', name='float_series')
series_2

0    0.1
1    0.2
2    0.3
3    0.4
4    0.5
5    0.6
6    0.7
7    0.8
Name: float_series, dtype: float64

In [19]:
# 3. Create a `Series` object with `object` data type and size of 3. Give it a unique name
series_3 = pd.Series(['Vincenzo', 'Squid Game', 'Hospital Playlist'], dtype='object', name='kdrama_2021')
series_3

0             Vincenzo
1           Squid Game
2    Hospital Playlist
Name: kdrama_2021, dtype: object

In [20]:
# 4. Create a `DataFrame` object with all `int64` data type and shape of `(5,2)`.
dataframe_4 = pd.DataFrame(
    {
        "col_1": [0,333,666,999,1234],
        "col_2": range(5)
    }, dtype='int64'
)
dataframe_4

   col_1  col_2
0      0      0
1    333      1
2    666      2
3    999      3
4   1234      4

In [21]:
# 5. Create a `DataFrame` object with `float64`, `float64` and `object` data type and 
# shape of `(8,3)`, columns in that order. 
# Make use of the `Series` object created in Practice 1, 2, and 3.
dataframe_5 = pd.DataFrame({
    series_1.name: series_1,
    series_2.name: series_2,
    series_3.name: series_3
})
dataframe_5

   int_series  float_series        kdrama_2021
0       100.0           0.1           Vincenzo
1       200.0           0.2         Squid Game
2       300.0           0.3  Hospital Playlist
3       400.0           0.4                NaN
4       500.0           0.5                NaN
5         NaN           0.6                NaN
6         NaN           0.7                NaN
7         NaN           0.8                NaN

In [26]:
# 02_load_and_save
# 1. Export the `DataFrame` that you have created in Chapter 1 to the `exports/` folder in the form of `csv` file.
try:
    dataframe_5.to_csv("exports/dataframe_5.csv", index_label=False)
except FileNotFoundError as e:
    import os
    os.mkdir("exports")
    dataframe_5.to_csv("exports/dataframe_5.csv", index_label=False)

**Copyright (C) 2021  Lee Kian Yang**

This program is licensed under MIT license.